# CannotPasteCircularLinks Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteCircularLinks Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
The pasted selection includes a linked instance of this file '[Name]'. A file cannot link itself, so the link was not pasted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteCircularLinks { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteCircularLinks As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteCircularLinks {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace